tutorials/RAS/Grilli2017/1D_sedimentation/0_org/gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.;

boundaryField
{
  inlet
  {
      type            cyclic;
  }
  outlet
  {
      type            cyclic;
  }
    top
    {
        type            zeroGradient;
    }
    plane
    {
        type            zeroGradient;
    }
    planeA
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    backPlane
    {
        type            empty;
    }
    frontPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
