tutorials/RAS/Grilli2017/1D_sedimentation/Allrun
#!/bin/sh

# Create the mesh
blockMesh

cp -r 0_org 0

setFields

# Run sedFoam
sedInterFoam > log&

