tutorials/RAS/Grilli2017/1D_sedimentation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * sediment properties * * * * * * * * * * * * //
phasesolid
{
    rho             rho [ 1 -3 0 0 0 ] 2500;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 4e-4;
    hExp            hExp [ 0 0  0 0 0 0 0 ] 2.65;  // hindrance exponent for drag: beta^(-hExp) (2.65 by default)
}
// * * * * * * * * * * * * water properties * * * * * * * * * * * * //
phasewater
{
    rho             rho [ 1 -3 0 0 0 ] 1000;
    nu              nu [ 0 2 -1 0 0 ] 1e-06;
    d               d [ 0 1 0 0 0 0 0 ] 4e-4;
}
// * * * * * * * * * * * * gas properties * * * * * * * * * * * * //
phasegas
{
    rho             rho [ 1 -3 0 0 0 ] 1.0;
    nu              nu [ 0 2 -1 0 0 ] 1.48e-05;
    d               d [ 0 1 0 0 0 0 0 ] 4e-4;
}
//*********************************************************************** //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;

nuMax           nuMax [0 2 -1 0 0 0 0] 1e0;      // viscosity limiter for the Frictional model (required for stability)

alphasSmall      alphasSmall [ 0 0 0 0 0 0 0 ] 1e-8;  // minimum volume fraction (phase a) for division by alpha

// ************************************************************************* //
