tutorials/RAS/Grilli2017/1D_sedimentation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;




vertices
(
    (0.1 0.18     0.25) //0
    (0.81 0.18     0.25) //1
    (0.81 0.31  0.25) //2
    (0.1 0.31 0.25) //3
    (0.1 0.18    -0.0) //4
    (0.81 0.18    -0.0) //5
    (0.81 0.31 -0.0) //6
    (0.1 0.31 -0.0) //7
);
blocks
(
    hex (0 1 5 4 3 2 6 7) (1 1 130) simpleGrading (1 1 1)

);

edges
(
);







boundary
(
  inlet
  {
   type   cyclic;
   neighbourPatch outlet;
   faces ((0 3 7 4));
  }
  outlet
  {
   type   cyclic;
   neighbourPatch  inlet;
   faces  ((1 5 6 2));
  }

  top
  {
   type wall;
      faces ((7 6 2 3));
  }
  bottom
  {
   type wall;
   faces ((0 4 5 1));
  }
    // patch plane



    frontPlane
    {
    type empty;
    faces (
           (4 7 6 5)
          );
    }

    backPlane
    {
    type empty;
    faces (
           (0 1 2 3)
          );
    }





);


mergePatchPairs
(
);

// ************************************************************************* //
